
NIL
(%o1)                                done
(%i2)                                         3 log(m)  1/9
(%o2)                     z(m) := (1 + ----------)
                                                3
                                       2 (4 %pi)
(%i3) (%o3)                         1.00019324093526b0
(%i4) (%o4)                         1.000386183652614b0
(%i5) (%o5)                         1.000578829128344b0
(%i6) (%o6)                                 inf
(%i7)                           3 log(m)     1/9
(%o7)               plot((-------- + 1)   , [m, 0, 10000])
                                 3
                          128 %pi
(%i8) 
NIL
(%o9)                                done
(%i10)                                         3 log(m)  1/9
(%o10)                    z(m) := (1 + ----------)
                                                3
                                       2 (4 %pi)
(%i11) (%o11)                        1.00019324093526b0
(%i12) (%o12)                        1.000386183652614b0
(%i13) (%o13)                        1.000578829128344b0
(%i14) (%o14)                                inf
(%i15) plot2d: expression evaluates to non-numeric value somewhere in plotting range.
(%o15)     [/Users/rds/maxout.gnuplot_pipes, /Users/rds/maxplot.qt]
(%i16)                                  2       3/2  3
                           z(m) p    z(m)    p           1/2
(%o16)          v(p, m) := ------- - ---------- + (- z(m)   ) p
                              2          6
(%i17) (%o17)     [/Users/rds/maxout.gnuplot_pipes, /Users/rds/maxplot.qt]
(%i18)                                    2    3/2  3
                                z p    z    p        1/2
(%o18)              vv(p, z) := ---- - ------- + (- z   ) p
                                 2        6
(%i19) plot2d: some values were clipped.
plot2d: some values were clipped.
plot2d: some values were clipped.
(%o19)     [/Users/rds/maxout.gnuplot_pipes, /Users/rds/maxplot.qt]
(%i20) (%o20)     [/Users/rds/maxout.gnuplot_pipes, /Users/rds/maxplot.qt]
(%i21) NIL
(%o3)                                done
(%i4) z(m):=(1+(3*log(m))/(2*(4*%pi)^3))^(1/9)
                                        3 log(m)  1/9
(%o4)                     z(m) := (1 + ----------)
                                                3
                                       2 (4 %pi)
(%i5) ev(z(10),bfloat)
(%o5)                         1.00019324093526b0
(%i6) ev(z(100),bfloat)
(%o6)                         1.000386183652614b0
(%i7) ev(z(1000),bfloat)
(%o7)                         1.000578829128344b0
(%i8) limit(z(m),m,inf)
(%o8)                                 inf
(%i9) plot(z(m),[m,0,10000])
                          3 log(m)     1/9
(%o9)               plot((-------- + 1)   , [m, 0, 10000])
                                 3
                          128 %pi
(%i10) closefile()
NIL
(%o11)                               done
(%i12) z(m):=(1+(3*log(m))/(2*(4*%pi)^3))^(1/9)
                                        3 log(m)  1/9
(%o12)                    z(m) := (1 + ----------)
                                                3
                                       2 (4 %pi)
(%i13) ev(z(10),bfloat)
(%o13)                        1.00019324093526b0
(%i14) ev(z(100),bfloat)
(%o14)                        1.000386183652614b0
(%i15) ev(z(1000),bfloat)
(%o15)                        1.000578829128344b0
(%i16) limit(z(m),m,inf)
(%o16)                                inf
(%i17) plot2d(z(m),[m,0,10000])
plot2d: expression evaluates to non-numeric value somewhere in plotting range.
(%o17)     [/Users/rds/maxout.gnuplot_pipes, /Users/rds/maxplot.qt]
(%i18) v(p,m):=(z(m)*p^2)/2-(z(m)^(3/2)*p^3)/6+(-z(m)^(1/2))*p
                                 2       3/2  3
                           z(m) p    z(m)    p           1/2
(%o18)          v(p, m) := ------- - ---------- + (- z(m)   ) p
                              2          6
(%i19) plot2d([v(p,10),v(p,100),v(p,1000)],[p,-10,10])
(%o19)     [/Users/rds/maxout.gnuplot_pipes, /Users/rds/maxplot.qt]
(%i20) vv(p,z):=(z*p^2)/2-(z^(3/2)*p^3)/6+(-z^(1/2))*p
                                   2    3/2  3
                                z p    z    p        1/2
(%o20)              vv(p, z) := ---- - ------- + (- z   ) p
                                 2        6
(%i21) plot2d([vv(p,10),vv(p,100),vv(p,1000)],[p,-1,1],[y,-10,10])
plot2d: some values were clipped.
plot2d: some values were clipped.
plot2d: some values were clipped.
(%o21)     [/Users/rds/maxout.gnuplot_pipes, /Users/rds/maxplot.qt]
(%i22) plot2d([vv(p,10),vv(p,100),vv(p,1000)],[p,-10,10])
(%o22)     [/Users/rds/maxout.gnuplot_pipes, /Users/rds/maxplot.qt]
(%i23) closefile()
