maxima_userdir is  /home/rds/.maxima 
(%i1) batch("DC.mac")

read and interpret /home/rds/Documents/Maxima/NYCCT/Lec/DC.mac
(%i2) "Let us study some DC-circuits with Maxima.

The materials in this note is
  section 21.6  DC circuits
  section 23.10 RL circuit

"
(%i3) kill(Q,E,C,R,t)
(%i4) "Let us first consider RC-circuit 

  Figure 21.38

which is consist of a single loop with an EMF (E[V]), a resistor (R[Ohm]), and a condenser (C[F]).
Around this circuit, the Kirchhoff's loop rule becomes the following DE:"
(%i5) deq:0 = E-R*'diff(Q(t),t,1)+(-Q(t))/C
                                 d             Q(t)
(%o5)                  0 = (- R (-- (Q(t)))) - ---- + E
                                 dt             C
(%i6) "where we have used the following fact: the current I is defined as the flow of the charge (see eq.(20.1)), i.e., the rate of charge change in time is current."
(%i7) "Setting the initial condition, no-charge at t=0, we can solve this DE:"
(%i8) atvalue(Q(t),t = 0,0)
(%o8)                                  0
(%i9) sol:desolve(deq,Q(t))
                                                 t
                                              - ---
                                                C R
(%o9)                      Q(t) = C E - C E %e
(%i10) "So we obtain the charge as a function of time t:"
(%i11) define(Q(t),rhs(sol))
                                                  t
                                               - ---
                                                 C R
(%o11)                     Q(t) := C E - C E %e
(%i12) "Since the current I is defined as the charge-flow-rate (eq.(20.1)), we can define the current as the time derivative of charge:"
(%i13) define(I(t),diff(Q(t),t,1))
                                              t
                                           - ---
                                             C R
                                       E %e
(%o13)                         I(t) := ---------
                                           R
(%i14) "Finally, we can define the voltage across the condenser.
Note that the capacitance is defined as the proportional constant Q vs. V (see eq.(19.48)).
Thus, the behavior of V is essentially the same as Q."
(%i15) define(V(t),expand(Q(t)/C))
                                                t
                                             - ---
                                               C R
(%o15)                       V(t) := E - E %e
(%i16) "As we can see, the denominator in the exponential, namely (C*R) is called the time constant of RC-circuit (see eq.(21.78)).

The following plot shows the behavior of charge and current in charging phase:
"
(%i17) plot2d(ev([Q(t),I(t)],E:R:C:1),[t,0,4],[legend,"Q(t)","I(t)"],
              [title,"Charging phase of RC-circuit (Fig. 21.38(b))"],
              [gnuplot_preamble,"set key center right"],[gnuplot_term,dumb])
                                                                               
                  Charging phase of RC-circuit (Fig. 21.38(b))                 
                                                                               
                  1 +----------------------------------------+                 
                    |#   +    +    +     +  **+****+****+    |                 
                    |##               *******                |                 
                0.8 |-+#           ****                    +-|                 
                    |  ##       ****                         |                 
                    |   ##    ***                            |                 
                0.6 |-+  ##  **                            +-|                 
                    |     ##*                                |                 
                    |     *##                   Q(t) ******* |                 
                0.4 |-+  **  ##                 I(t) ######+-|                 
                    |   **    ###                            |                 
                    |  **       ####                         |                 
                0.2 |-+*           ####                    +-|                 
                    |**               #######                |                 
                    |*   +    +    +     +  ##+####+####+    |                 
                  0 +----------------------------------------+                 
                    0   0.5   1   1.5    2   2.5   3   3.5   4                 
                                        t                                      
                                                                               
(%o17)           [/tmp/maxout32117.gnuplot, /tmp/maxplot.txt]
(%i18) kill(R,Q,C)
(%i19) "After a long enough time, we can assume that the condenser is fully charged (theoretically speaking, it takes infinite time, though).
Removing the battery (i.e., the EMF) we close the circuit:"
(%i20) deq2:Q(t)/C+R*'diff(Q(t),t,1) = 0
                              d            Q(t)
(%o20)                     R (-- (Q(t))) + ---- = 0
                              dt            C
(%i21) "Setting the initial condition, fully-charged at t=0, we can solve this DE:"
(%i22) atvalue(Q(t),t = 0,Q0)
(%o22)                                Q0
(%i23) sol2:desolve(deq2,Q(t))
                                              t
                                           - ---
                                             C R
(%o23)                         Q(t) = Q0 %e
(%i24) "So this is dis-charging phase, both current and charge are dissipating:"
(%i25) define(Q2(t),rhs(sol2))
                                               t
                                            - ---
                                              C R
(%o25)                        Q2(t) := Q0 %e
(%i26) define(I2(t),diff(Q2(t),t,1))
                                                t
                                             - ---
                                               C R
                                        Q0 %e
(%o26)                       I2(t) := - ----------
                                           C R
(%i27) "In the discharging phase, Q and I are shown in the following plot: "
(%i28) plot2d(ev([Q2(t),I2(t)],Q0:R:C:1),[t,0,4],[legend,"Q2(t)","I2(t)"],
              [title,"Dis-charging phase of RC-circuit (Fig.21.39 (b))"],
              [gnuplot_preamble,"set key top right"],[gnuplot_term,dumb])
                                                                               
                Dis-charging phase of RC-circuit (Fig.21.39 (b))               
                                                                               
                  1 +----------------------------------------+                 
                    |**  +    +    +     +    +    +    +    |                 
                    | ***                      Q2(t) ******* |                 
                    |   ***                    I2(t) ####### |                 
                0.5 |-+    ***                             +-|                 
                    |         ****                           |                 
                    |             ********                   |                 
                  0 |----------------------------------------|                 
                    |                    ####################|                 
                    |             ########                   |                 
                    |         ####                           |                 
               -0.5 |-+    ###                             +-|                 
                    |   ###                                  |                 
                    | ###                                    |                 
                    |##  +    +    +     +    +    +    +    |                 
                 -1 +----------------------------------------+                 
                    0   0.5   1   1.5    2   2.5   3   3.5   4                 
                                        t                                      
                                                                               
(%o28)           [/tmp/maxout32117.gnuplot, /tmp/maxplot.txt]
(%i29) "Let us consider another circuit, RL-circuit.

  section 23.10 RL circuit

The first stage consists of EMF, R and L (Figure 23.44 of 1).
Around the loop, we can write the Kirchhoff's loop rule as the following DE:
"
(%i30) kill(V,R,I,L)
(%i31) deq3:V-R*I(t)+(-L)*'diff(I(t),t,1) = 0
                            d
(%o31)                (- L (-- (I(t)))) - R I(t) + V = 0
                            dt
(%i32) atvalue(I(t),t = 0,0)
(%o32)                                 0
(%i33) "where we have used  eq.(23.37) for the induced emf at the inductance L."
(%i34) "Solveing the DE, we obtain the current as a function of t:"
(%i35) sol3:desolve(deq3,I(t))
                                              R t
                                            - ---
                                               L
                                    V   V %e
(%o35)                       I(t) = - - ---------
                                    R       R
(%i36) define(I(t),ev(I(t),sol3))
                                               R t
                                             - ---
                                                L
                                     V   V %e
(%o36)                       I(t) := - - ---------
                                     R       R
(%i37) plot2d(ev(I(t),V:R:L:1),[t,0,4],[legend,"I(t)"],
              [title,"Charging phase of RL-circuit (Fig. 23.44 (b))"],
              [ylabel,"current"],[gnuplot_preamble,"set key center"],
              [gnuplot_term,dumb])
                                                                               
                      Charging phase of RL-circuit (Fig. 23.44 (b))            
                                                                               
                      1 +---------------------------------------+              
                    0.9 |-+  +    +    +    +  **+****+****+  +-|              
                        |                 ******                |              
                    0.8 |-+            ****                   +-|              
                    0.7 |-+         ***                       +-|              
                        |         ***                           |              
                    0.6 |-+     ***                           +-|              
                    0.5 |-+    **                             +-|              
         current        |     **      I(t) *******              |              
                    0.4 |-+  **                               +-|              
                    0.3 |-+ *                                 +-|              
                        |  *                                    |              
                    0.2 |-+*                                  +-|              
                    0.1 |-+                                   +-|              
                        |*   +    +    +    +    +    +    +    |              
                      0 +---------------------------------------+              
                        0   0.5   1   1.5   2   2.5   3   3.5   4              
                                            t                                  
                                                                               
(%o37)           [/tmp/maxout32117.gnuplot, /tmp/maxplot.txt]
(%i38) "After reaching steady current status (a cirtain time after, theoretically speaking after infinite time!), let's remove the EMF.
The circuit now becomes the discharging phase when we short the circuit, namely Figure 23.44 of 2.:"
(%i39) kill(I)
(%i40) deq4:(-R)*I(t)+(-L)*'diff(I(t),t,1) = 0
                              d
(%o40)                  (- L (-- (I(t)))) - R I(t) = 0
                              dt
(%i41) atvalue(I(t),t = 0,I0)
(%o41)                                I0
(%i42) sol4:desolve(deq4,I(t))
                                             R t
                                           - ---
                                              L
(%o42)                         I(t) = I0 %e
(%i43) define(I(t),ev(I(t),sol4))
                                             R t
                                           - ---
                                              L
(%o43)                        I(t) := I0 %e
(%i44) plot2d(ev(I(t),I0:R:L:1),[t,0,4],[legend,"I(t)"],
              [title,"Dis-charging phase of RL-circuit (Fig. 23.44 (c))"],
              [ylabel,"current"],[gnuplot_preamble,"set key center"],
              [gnuplot_term,dumb])
                                                                               
                    Dis-charging phase of RL-circuit (Fig. 23.44 (c))          
                                                                               
                      1 +---------------------------------------+              
                    0.9 |-+  +    +    +    +    +    +    +  +-|              
                        |**                                     |              
                    0.8 |-+*                                  +-|              
                    0.7 |-+*                                  +-|              
                        |   *                                   |              
                    0.6 |-+  **                               +-|              
                    0.5 |-+   **                              +-|              
         current        |      **     I(t) *******              |              
                    0.4 |-+     ***                           +-|              
                    0.3 |-+       ***                         +-|              
                        |           ***                         |              
                    0.2 |-+            ****                   +-|              
                    0.1 |-+               ******              +-|              
                        |    +    +    +    +  **+****+****+    |              
                      0 +---------------------------------------+              
                        0   0.5   1   1.5   2   2.5   3   3.5   4              
                                            t                                  
                                                                               
(%o44)           [/tmp/maxout32117.gnuplot, /tmp/maxplot.txt]
(%o45)            /home/rds/Documents/Maxima/NYCCT/Lec/DC.mac
