Maxima 5.41.0 http://maxima.sourceforge.net
using Lisp SBCL 1.4.7
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
maxima_userdir is  /home/rds/.maxima 
(%i1) batch("QM1_2018_8.mac")

read and interpret file: /home/rds/Documents/Maxima/QM/QM1_2018_8.mac
(%i2) kill(all)
(%o0)                                done
(%i1) "Problem 2:"
(%i2) assume(N > 0,a > 0)
(%i3) rho(x):=N^2/(x^2+a^2)
                                            2
                                           N
(%o3)                          rho(x) := -------
                                          2    2
                                         x  + a
(%i4) sol:solve(1 = integrate(rho(x),x,-inf,inf),N)
                               sqrt(a)        sqrt(a)
(%o4)                  [N = - ---------, N = ---------]
                              sqrt(%pi)      sqrt(%pi)
(%i5) is(rhs(sol[2]) > 0)
(%o5)                                true
(%i6) define(rho(x),at(rho(x),sol[2]))
                                            a
(%o6)                       rho(x) := -------------
                                            2    2
                                      %pi (x  + a )
(%i7) declare(d,real)
(%o7)                                done
(%i8) depends(d,x)
(%o8)                               [d(x)]
(%i9) "In general, there is a phase freedom:"
(%i10) define(phi(x),at(N/sqrt(x^2+a^2),sol[2])*exp(%i*d))
                                               %i d
                                     sqrt(a) %e
(%o10)                 phi(x) := -----------------------
                                                 2    2
                                 sqrt(%pi) sqrt(x  + a )
(%i11) define(phid(x),conjugate(phi(x)))
                                              - %i d
                                    sqrt(a) %e
(%o11)                phid(x) := -----------------------
                                                 2    2
                                 sqrt(%pi) sqrt(x  + a )
(%i12) average_x:integrate(phid(x)*x*phi(x),x,-inf,inf)
Principal Value
(%o12)                                 0
(%i13) "The phase is a function of x"
(%i14) dphi:radcan(expand(diff(phi(x),x,1)))
                     2    2        %i d dd  2     %i d         2   %i d dd
       sqrt(a) sqrt(x  + a ) (%i %e     -- x  - %e     x + %i a  %e     --)
                                        dx                              dx
(%o14) --------------------------------------------------------------------
                                      4      2  2    4
                          sqrt(%pi) (x  + 2 a  x  + a )
(%i15) average_k:integrate(phid(x)*dphi,x,-inf,inf)
                   inf        %i d dd  2     %i d         2   %i d dd
                  /      %i %e     -- x  - %e     x + %i a  %e     --
           - %i d [                dx                              dx
       a %e       I      -------------------------------------------- dx
                  ]                    4      2  2    4
                  /                   x  + 2 a  x  + a
                   - inf
(%o15) -----------------------------------------------------------------
                                      %pi
(%i16) "Consider a limit case; constant phase."
(%i17) declare(d,constant)
(%o17)                               done
(%i18) average_k:integrate(phid(x)*diff(phi(x),x,1),x,-inf,inf)
(%o18)                                 0
(%i19) "Another case; a linear phase, which has a shifted momentum:"
(%i20) assume(d > 0)
(%o20)                              [0 < d]
(%i21) define(phi(x),ev(at(N/sqrt(x^2+a^2),sol[2])*exp(%i*d),d:d*x))
                                              %i d x
                                    sqrt(a) %e
(%o21)                 phi(x) := -----------------------
                                                 2    2
                                 sqrt(%pi) sqrt(x  + a )
(%i22) phi(x)
                                         %i d x
                               sqrt(a) %e
(%o22)                      -----------------------
                                            2    2
                            sqrt(%pi) sqrt(x  + a )
(%i23) dphi:conjugate(phi(x))
                                        - %i d x
                              sqrt(a) %e
(%o23)                      -----------------------
                                            2    2
                            sqrt(%pi) sqrt(x  + a )
(%i24) kernel:dphi*(-%i)*diff(phi(x),x,1)
(%o24) 
                                              %i d x                  %i d x
                    - %i d x   %i d sqrt(a) %e            sqrt(a) x %e
       %i sqrt(a) %e         (----------------------- - ----------------------)
                                              2    2                2    2 3/2
                              sqrt(%pi) sqrt(x  + a )   sqrt(%pi) (x  + a )
     - ------------------------------------------------------------------------
                                               2    2
                               sqrt(%pi) sqrt(x  + a )
(%i25) integrate(kernel,x,minf,inf)
(%o25)                                 d
(%i26) " Problem 3 "
(%i27) kill(N,a,phi)
(%i28) assume(N > 0,a > 0)
(%i29) phi(x):=N*exp(((-a)*x^2)/2)
                                                 2
                                            - a x
(%o29)                      phi(x) := N exp(------)
                                              2
(%i30) sol:solve(1 = integrate(conjugate(phi(x))*phi(x),x,-inf,inf),N)
                                   1/4         1/4
                                  a           a
(%o30)                    [N = - ------, N = ------]
                                    1/4         1/4
                                 %pi         %pi
(%i31) is(rhs(sol[2]) > 0)
(%o31)                               true
(%i32) define(phi(x),at(phi(x),sol[2]))
                                                  2
                                               a x
                                             - ----
                                       1/4      2
                                      a    %e
(%o32)                      phi(x) := -------------
                                            1/4
                                         %pi
(%i33) square_x:integrate(conjugate(phi(x))*x^2*phi(x),x,-inf,inf)
                                       1
(%o33)                                ---
                                      2 a
(%i34) assume(h > 0)
(%i35) ps:makelist(integrate(conjugate(phi(x))*(%i*h)^j*diff(phi(x),x,j),x,
                             -inf,inf),j,1,4)
                                    2        2  4
                                 a h      3 a  h
(%o35)                       [0, ----, 0, -------]
                                  2          4
(%i36) xs:makelist(integrate(conjugate(phi(x))*x^j*phi(x),x,-inf,inf),j,1,4)
                                    1       3
(%o36)                         [0, ---, 0, ----]
                                   2 a        2
                                           4 a
(%i37) assume(j > 0)
(%i38) declare(j,integer)
(%i39) integrate(conjugate(phi(x))*x^(2*j+1)*phi(x),x,-inf,inf)
(%o39)                                 0
(%i40) average_x:integrate(conjugate(phi(x))*x*phi(x),x,-inf,inf)
(%o40)                                 0
(%i41) delta_x:square_x-average_x^2
                                       1
(%o41)                                ---
                                      2 a
(%i42) delta_p:ps[2]-ps[1]^2
                                        2
                                     a h
(%o42)                               ----
                                      2
(%i43) delta_x*delta_p
                                       2
                                      h
(%o43)                                --
                                      4
(%i44) assume(m > 0)
(%i45) E:ps[2]/(2*m)
                                        2
                                     a h
(%o45)                               ----
                                     4 m
(%i46) EE:ps[4]/(4*m^2)
                                       2  4
                                    3 a  h
(%o46)                              -------
                                         2
                                     16 m
(%i47) delta_E:EE-E^2
                                      2  4
                                     a  h
(%o47)                               -----
                                        2
                                     8 m
(%o47)           /home/rds/Documents/Maxima/QM/QM1_2018_8.mac
