Maxima 5.41.0 http://maxima.sourceforge.net
using Lisp SBCL 1.4.7
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
maxima_userdir is  /home/rds/.maxima 
(%i1) batch("mid2.mac")

read and interpret file: /home/rds/Documents/Maxima/NYCCT/mid2.mac
(%i2) kill(all)
(%o0)                                done
(%i1) "1 (from Ex.19.11 Recharging a battery)"
(%i2) "1 (a)"
(%i3) j1:1+3 = I
(%o3)                                4 = I
(%i4) "1 (b)"
(%i5) l1:(-4)*1+9+(-r)*I = 0
(%i6) l2:(-4)*1-E+3*1 = 0
(%i7) l3:(-3)*1+E+9+(-r)*I
(%i8) rE:at(linsolve([l1,l2],[r,E]),linsolve(j1,[I]))
                                    5
(%o8)                          [r = -, E = - 1]
                                    4
(%i9) "1 (c)"
(%i10) at(l3,linsolve(j1,[I]))
(%o10)                          (- 4 r) + E + 6
(%i11) at(%,rE)
(%o11)                                 0
(%i12) "1 (d), (e) and (f)"
(%i13) "The power in and out, and its check."
(%i14) P:9*4-3*1
(%o14)                                33
(%i15) 4*1^2+1*3^2+(5/4)*4^2
(%o15)                                33
(%i16) "2 (from Ex.20.2 Electron motion in a mircowave oven)"
(%i17) "2 (b)"
(%i18) eom:e*v*B = (m*v^2)/r
                                            2
                                         m v
(%o18)                           B e v = ----
                                          r
(%i19) "2 (c)"
(%i20) req:solve(eom,r)
                                        m v
(%o20)                             [r = ---]
                                        B e
(%i21) ev(rhs(req[1]),m:9.11e-31,v:10000000.0,e:1.6e-19,B:0.1)
(%o21)                            5.69375e-4
(%i22) "2 (d)"
(%i23) kill(v)
(%i24) veq:solve(eom,v)
                                   B e r
(%o24)                        [v = -----, v = 0]
                                     m
(%i25) v:ev(rhs(veq[1]),B:0.1,e:1.6e-19,r:0.1,m:9.11e-31)
(%o25)                       1.756311745334797e+9
(%i26) "2 (e)"
(%i27) solve(v*T = 2*%pi*r,T)

rat: replaced 1.756311745334797e+9 by 1201317233809/684 = 1.756311745334795e+9
(%i28) Teq:solve(v*T = 2*%pi*r,T)

rat: replaced 1.756311745334797e+9 by 1201317233809/684 = 1.756311745334795e+9
(%i29) ev(rhs(Teq[1]),r:0.1,numer)
(%o29)                       3.577488634275381e-10
(%i30) "2 (f)"
(%i31) omega:2*%pi*f
(%i32) ev(omega,f:2.45e+9,numer)
(%o32)                       1.539380400258999e+10
(%i33) "2 (g)"
(%i34) kill(B)
(%o34)                               done
(%i35) Beq:solve(eom,B)
                                        m v
(%o35)                             [B = ---]
                                        e r
(%i36) B:ev(rhs(Beq[1]),v:r*omega)
                                   2 %pi f m
(%o36)                             ---------
                                       e
(%i37) ev(B,f:2.45e+9,m:9.11e-31,e:1.6e-19,bfloat)
(%o37)                       8.764847153974674b-2
(%i38) "2 (h)"
(%i39) ev(B,f:2.5e+9,m:9.11e-31,e:1.6e-19,bfloat)
(%o39)                       8.943721585688443b-2
(%i40) "3 (a)"
(%i41) E:0.012*0.02
(%o41)                              2.4e-4
(%i42) "3 (b)"
(%i43) I:E/R
(%i44) ev(I,R:5.0)
(%o44)                              4.8e-5
(%i45) "3 (c)"
(%i46) E:0.01*0.25
(%o46)                              0.0025
(%i47) I:E/R
(%i48) ev(I,R:2.5,bfloat)
(%o48)                              1.0b-3
(%i49) "3 (d)"
(%i50) E:ev((B*L*v*dt)/dt,B:0.6,L:0.1,v:2.5)
(%o50)                               0.15
(%i51) "3 (e)"
(%i52) ev(I:E/R,R:0.03)
(%o52)                                5.0
(%i53) "3 (f)"
(%i54) kill(q,v,B,I)
(%i55) F:q*v*B
(%i56) F:ev(F,q:I*dt,v:l/dt)
(%o56)                               B I l
(%i57) "3 (g)"
(%i58) ev(F,B:0.6,I:5.0,l:0.1)
(%o58)                                0.3
(%i59) "3 (h), (i), (j)"
(%i60) ev(F*v,B:0.6,I:5.0,l:0.1,v:2.5)
(%o60)                        0.7500000000000001
(%i61) ev(E*I,I:5.0)
(%o61)                               0.75
(%i62) ev(R*I^2,R:0.03,I:5.0)
(%o62)                               0.75
(%o62)             /home/rds/Documents/Maxima/NYCCT/mid2.mac
