maxima_userdir is  /home/rds/.maxima 
(%i1) batch("ex18withConst.mac")

read and interpret /home/rds/Documents/Maxima/NYCCT/Lec/ex18withConst.mac
(%i2) kill(all)
(%o0)                                done
(%i1) load(physical_constants)
(%i2) "ex. 18.1 (section 18.3):"
(%i3) k:1/(4*%pi*%e_0)
(%i4) ev(constvalue(k),numer)
                                                   2
                                                N m
(%o4)                    8.987551787368178e+9 ` -----
                                                 2  2
                                                A  s
(%i5) "eq.(18.5) - eq.(18.7) "
(%i6) ev(Fc:(k*q1*q2)/r^2,q1:q2:%%e,r:5.3e-11 ` m)
(%i7) ev(constvalue(Fc),numer)
                                                 2
                                                C  N
(%o7)                    8.213161722093849e-8 ` -----
                                                 2  2
                                                A  s
(%i8) dimensions(Fc)
                                  length mass
(%o8)                             -----------
                                         2
                                     time
(%i9) "eq.(18.8) - eq.(18.9) "
(%i10) ev(Fg:(%G*m*M)/r^2,m:9.11e-31 ` kg,M:1.67e-27 ` kg,r:5.3e-11 ` m)
(%i11) ev(constvalue(Fg),numer)
                                                 kg m
(%o11)                   3.614827114133143e-47 ` ----
                                                   2
                                                  s
(%i12) "eq.(18.10):"
(%i13) r:Fc/Fg
(%i14) ev(constvalue(r),numer)
                                                 2
                                                C  N
(%o14)                  2.27207594243782e+39 ` -------
                                                2
                                               A  kg m
(%i15) dimensions(r)
(%o15)                                 1
(%i16) "ex. 18.2 (section 18.4)"
(%i17) "eq.(18.14):"
(%i18) ev(E:(k*Q)/r^2,Q:2.0e-9 ` C,r:0.005 ` m)
(%i19) ev(constvalue(E),bfloat)
                                              1.0b0 C N
(%o19)                  7.190041429894542b5 ` ---------
                                                 2  2
                                                A  s
(%i20) dimensions(E)
                                  length mass
(%o20)                           -------------
                                             3
                                 current time
(%i21) "ex. 18.3 (section 18.4)"
(%i22) "eq.(18.15):"
(%i23) ev(E*q,q:2.5e-7 ` C)
(%i24) ev(constvalue(%),numer)
                                                2
                                               C  N
(%o24)                    0.1797510357473636 ` -----
                                                2  2
                                               A  s
(%i25) dimensions(E)
                                  length mass
(%o25)                           -------------
                                             3
                                 current time
(%i26) "ex. 18.4 (section 18.4)"
(%i27) "The x and y components, eq.(18.17) and eq.(18.16):"
(%i28) ev(Ex:((-k)*q2)/r2^2,q2:1.0e-8 ` C,r2:0.04 ` m)
(%i29) ev(constvalue(Ex),numer)
                                                  C N
(%o29)                   (- 56172.19867105111) ` -----
                                                  2  2
                                                 A  s
(%i30) ev(Ey:(k*q1)/r1^2,q1:5.0e-9 ` C,r1:0.02 ` m)
(%i31) ev(constvalue(Ey),numer)
                                                C N
(%o31)                     112344.3973421022 ` -----
                                                2  2
                                               A  s
(%i32) "eq.(18.18):"
(%i33) E:sqrt(Ex^2+Ey^2)
                                      2                     2
                      9.765625e-12   C    2.44140625e-12   C
                      ------------ ` --   -------------- ` --
                             2        4           2         4
                          %pi        m         %pi         m
(%o33)           sqrt(----------------- + -------------------)
                                2                    2
                            %e_0                 %e_0
(%i34) ev(constvalue(E),bfloat)
                                              1.0b0 C N
(%o34)                  1.256048546740936b5 ` ---------
                                                 2  2
                                                A  s
(%i35) "eq.(18.19):"
(%i36) theta:atan(Ey/Ex)
(%i37) ev(abs((theta*180)/%pi),numer)
(%o37)                         63.43494882292201
(%i38) "1: "
(%i39) ans:(2.0*10^-9 ` C)/%%e
(%i40) ev(constvalue(ans),numer)
(%o40)                       1.248301929424084e+10
(%i41) ev(constvalue((0.5*10^-6 ` C)/%%e),numer)
(%o41)                       3.120754823560208e+12
(%i42) "4: "
(%i43) ev(constvalue((40.0 ` C)/%%e),bfloat)
(%o43)                       2.496603858848167b20
(%i44) "5: "
(%i45) sol:solve((-5.0)*10^-9 ` C = (n-1.0*10^12)*(-%%e),n)

rat: replaced -5.0e-9 by -1/200000000 = -5.0e-9

rat: replaced -1.0e+12 by -1000000000000/1 = -1.0e+12
(%i46) ev(constvalue(sol[1]),numer)
(%o46)                     n = 1.031207548235602e+12
(%i47) "7: "
(%i48) mol_of_Cu:50/63.5 ` mol
(%o48)                     0.7874015748031497 ` mol
(%i49) num_of_e:(2.0*10^-6 ` C)/%%e
                                  2.0e-6 ` C
(%o49)                            ----------
                                     %%e
(%i50) total_num_of_e:29*mol_of_Cu*%N_A
(%o50)                  %N_A (22.83464566929134 ` mol)
(%i51) "The fraction of electrons that has been removed:"
(%i52) ev(constvalue(num_of_e/total_num_of_e),numer)
(%o52)                       9.077669944724307e-13
(%i53) "21: "
(%i54) kill(q1,q2,r)
(%o54)                               done
(%i55) declare_units(r,m)
(%i56) ev(Fc:(k*q1*q2)/r^2,q1:q2:%%e)
(%i57) dimensions(Fc)
                                  length mass
(%o57)                            -----------
                                         2
                                     time
(%i58) ev(Fg:(%G*m*M)/r^2,m:M:%m_e)
(%i59) dimensions(Fg)
                                  length mass
(%o59)                            -----------
                                         2
                                     time
(%i60) ev(constvalue(Fc/Fg),numer)
                                                  2
                                                 C  N
(%o60)                  4.165621901552388e+42 ` -------
                                                 2
                                                A  kg m
(%i61) dimensions(%)
(%o61)                                 1
(%i62) "28: "
(%i63) "Since the charge > 0, the direction still is east."
(%i64) ev(constvalue((3.5*10^-6 ` C)*(250 ` N/C)),numer)
(%o64)                     8.750000000000001e-4 ` N
(%i65) "32: "
(%i66) "An electron is negatively charged, the direction of e-field is eastward."
(%i67) ev(constvalue((4.8e-17 ` N)/%%e),numer)
                                                N
(%o67)                        299.59246306178 ` -
                                                C
(%o69)      /home/rds/Documents/Maxima/NYCCT/Lec/ex18withConst.mac
